========
Numbers
========

1 20 0.3 12.345 -1 -123 -10.12

---

(source_file
  (statement
    (number)
    (number)
    (number)
    (number)
    (number)
    (number)
    (number)))

========
Booleans
========

True False true TRUE fALSE FAlse

---

(source_file
  (statement
    (boolean)
    (boolean)
    (inline_comment)
    (boolean)
    (inline_comment)
    (boolean)))

========
Strings
========

"" "abc" "~" "~~"

---

(source_file
  (statement
    (string)
    (string)
    (string)
    (string)))

==============
String escapes
==============

"\""
"\n"
"\\"
"\"\n\r\t Hello";
" \" Inc; \" " " " Inc;
"\} \'"

---

(source_file
  (statement
    (string
      (escape_sequence))
    (string
      (escape_sequence))
    (string
      (escape_sequence))
    (string
      (escape_sequence)
      (escape_sequence)
      (escape_sequence)
      (escape_sequence)))
  (statement
    (string
      (escape_sequence)
      (escape_sequence))
    (string)
    (identifier))
  (statement
    (string)))

========
Symbols
========

Print \abc \a-b

---

(source_file
  (statement
    (identifier)
    (symbol)
    (symbol)))

