========
Numbers
========

1 20 0.3 12.345

---

(source_file
  (statement
    (number)
    (number)
    (number)
    (number)))

========
Booleans
========

True False

---

(source_file
  (statement
    (boolean)
    (boolean)))

========
Strings
========

"" "abc"

---

(source_file
  (statement
    (string)
    (string)))

==============
String escapes
==============

"\""
"\n"
"\\"
"\"\n\r\t Hello";
" \" Inc; \" " " " Inc;
"\} \'"

---

(source_file
  (statement
    (string
      (escape_sequence))
    (string
      (escape_sequence))
    (string
      (escape_sequence))
    (string
      (escape_sequence)
      (escape_sequence)
      (escape_sequence)
      (escape_sequence)))
  (statement
    (string
      (escape_sequence)
      (escape_sequence))
    (string)
    (identifier))
  (statement
    (string)))

========
Symbols
========

Print \abc \a-b

---

(source_file
  (statement
    (identifier)
    (symbol)
    (symbol)))

