========
Numbers
========

1 20 0.3 12.345

---

(source_file
  (statement
    (number)
    (number)
    (number)
    (number)))

========
Booleans
========

True False

---

(source_file
  (statement
    (boolean)
    (boolean)))

========
Strings
========

"" "abc"

---

(source_file
  (statement
    (string)
    (string)))

========
Symbols
========

Print \abc \a-b

---

(source_file
  (statement
    (identifier)
    (symbol)
    (symbol)))

